-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 23, 2017 at 08:08 AM
-- Server version: 10.1.21-MariaDB
-- PHP Version: 7.1.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `btljava`
--

-- --------------------------------------------------------

--
-- Table structure for table `thisinh`
--

CREATE TABLE `thisinh` (
  `MaThiSinh` int(11) NOT NULL,
  `HoVaTen` varchar(50) DEFAULT NULL,
  `MaQueQuan` int(11) DEFAULT NULL,
  `NgaySinh` varchar(11) DEFAULT NULL,
  `GioiTinh` tinyint(1) DEFAULT NULL,
  `Toan` float DEFAULT NULL,
  `Ly` float DEFAULT NULL,
  `Hoa` float DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `thisinh`
--

INSERT INTO `thisinh` (`MaThiSinh`, `HoVaTen`, `MaQueQuan`, `NgaySinh`, `GioiTinh`, `Toan`, `Ly`, `Hoa`) VALUES
(12, 'Nguyễn Đăng Dũng', 1, '1997/11/11', 1, 1, 1, 1),
(11111, 'Nguyễn Đăng Dũng', 1, '1997/11/11', 1, 10, 10, 10),
(11112, 'Nguyễn Đức Thành', 16, '1997-11-11', 1, 9, 9, 9),
(11113, 'Lường Đình Quân', 28, '1997/11/11', 1, 8, 8, 8),
(11114, 'Lê Mạnh Anh', 3, '1999/08/25', 0, 5.3, 7.1, 5.7),
(11115, 'Phạm Tuấn Anh', 6, '1999/06/17', 1, 8, 9.2, 7.4),
(11116, 'Nguyễn Thiện Anh', 9, '1999-08-21', 0, 7.1, 9.6, 5.6),
(11117, 'Thành Xuân Anh', 27, '1999/07/08', 1, 5.6, 5.5, 6.7),
(11118, 'Dương Thị Anh', 34, '1999/01/20', 0, 6.9, 5.8, 6.1),
(11119, 'Nguyễn Văn Anh', 40, '1999/02/20', 1, 7.5, 8.9, 7.3),
(11124, 'Trần Phương Anh', 61, '1999/09/01', 0, 5.9, 5.8, 5.1),
(11125, 'Vũ Ngọc Anh', 1, '1999/09/02', 1, 8.1, 7.6, 5.4),
(11126, 'Nguyễn Thế Anh', 7, '1999/05/25', 0, 6.9, 9.1, 6.9),
(11127, 'Nguyễn Thị Anh', 21, '1999/10/04', 1, 6.2, 7, 5.5),
(11128, 'Nguyễn Đức Anh', 40, '1999/09/11', 0, 7.7, 9.1, 7),
(11129, 'Nguyễn Văn Anh', 41, '1999/01/23', 1, 9.2, 8.5, 5.7),
(11130, 'Nguyễn Tuấn Anh', 47, '1999/01/20', 0, 6.7, 8.3, 9.9),
(11131, 'Nguyễn Anh Ban', 51, '1999/07/29', 1, 7.3, 9.9, 7.9),
(11132, 'Vũ Văn Bích', 56, '1999/05/16', 0, 6.1, 7.6, 5.1),
(11133, 'Nguyễn Lê Cầm', 25, '1999/02/28', 1, 7.5, 9.9, 9.7),
(11134, 'Đàm Việt Châm', 3, '1998/11/07', 0, 7.4, 6.5, 6.3),
(11135, 'Trần Hồng Châm', 39, '1999/01/31', 1, 6.7, 8.1, 6.4),
(11136, 'Lê Thị Chung', 42, '1999/07/21', 0, 7.7, 6, 8.8),
(11137, 'Nguyễn Mạnh Công', 24, '1999/03/06', 1, 9.2, 8.1, 9.7),
(11138, 'Trần Văn Cương', 11, '1999/12/13', 0, 8.5, 7.9, 7.9),
(11139, 'Nguyễn Việt Dân', 62, '1999/05/16', 1, 9.6, 6.6, 5.5),
(11140, 'Nguyễn Thi Đăng', 19, '1999/10/16', 0, 9.4, 7.9, 5.3),
(11141, 'Vũ Tuấn Đảo', 44, '1999/02/14', 1, 8.8, 8.2, 6.7),
(11142, 'Lê Văn Đạo', 16, '1999/09/30', 0, 5.7, 9.5, 9.9),
(11143, 'Nguyễn Tuấn Đạt', 4, '1998/11/03', 1, 7.8, 8, 6),
(11144, 'Lê Quang Đạt', 47, '1999/04/29', 0, 6.5, 6.4, 7.6),
(11145, 'Trần Đông Điềm', 55, '1998/06/03', 1, 6.5, 7.6, 8.6),
(11146, 'Lê Giáp Dinh', 3, '1999/12/16', 0, 8.6, 7.3, 6.6),
(11147, 'Lê Xuân Đô', 8, '1999/03/20', 1, 10, 8.8, 6.3),
(11148, 'Tống Vương Đôn', 26, '1999/12/10', 0, 7.5, 9.5, 7.1),
(11149, 'Lê Văn Đông', 21, '1999/09/04', 1, 7.7, 6.2, 8.5),
(11150, 'Bế Quang Đức', 4, '1999/05/25', 0, 7.2, 9.7, 5.9),
(11151, 'Nguyễn Văn Đức', 16, '1999/06/07', 1, 9.9, 5.1, 5.5),
(11152, 'Trương Thị Đức', 22, '1999/03/09', 0, 8.3, 6.2, 9.6),
(11153, 'Vũ Bá Đức', 34, '1999/10/02', 1, 7, 7, 5.2),
(11154, 'Vũ Tiến Đức', 50, '1999/01/19', 0, 9, 9.8, 5.9),
(11155, 'Mạnh Thành Dũng', 17, '1997/02/25', 1, 5.4, 9, 6.7),
(11156, 'Nguyễn Văn Dũng', 57, '1997/11/01', 0, 7.8, 8.6, 10),
(11157, 'Phạm Hoàng Dương', 1, '1999/01/18', 1, 9.6, 5.3, 9.9),
(11158, 'Nguyễn Thị Dương', 2, '1998/04/12', 0, 7.6, 5.1, 5.3),
(11159, 'Trần Văn Dương', 31, '1999/08/16', 1, 5.2, 7.9, 9.4),
(11160, 'Vũ Công Duy', 7, '1999/01/02', 0, 7.3, 9.9, 8.7),
(11161, 'Thái Hữu Duy', 41, '1999/07/03', 1, 8.6, 8.9, 7.5),
(11162, 'Trần Đức Giang', 54, '1999/08/18', 0, 9.6, 9, 6.9),
(11163, 'Nguyễn Văn Giang', 63, '1999/09/02', 1, 6.8, 9, 5.5),
(11164, 'Trần Đức Hải', 45, '1999/03/19', 0, 9.1, 5.2, 6.2),
(11165, 'Trần Văn Hải', 14, '1999/04/09', 1, 6.5, 8.3, 5.9),
(11166, 'Nguyễn Văn Hằng', 48, '1995/01/23', 0, 7.8, 7.4, 5.7),
(11167, 'Lê Văn Hảo', 54, '1999/05/01', 1, 8.8, 7.4, 8.2),
(11168, 'Vũ Duy Hậu', 19, '1999/10/23', 0, 9, 9.5, 5.3),
(11169, 'Mai Xuân Hậu', 51, '1999/04/08', 1, 6.4, 6, 7.1),
(11170, 'Lê Hồng Hiền', 60, '1999/11/10', 0, 6.2, 9, 6.9),
(11171, 'Hoàng Mạnh Hiền', 6, '1999/08/22', 1, 5.3, 9.9, 8),
(11172, 'Đặng Anh Hiển', 44, '1999/12/07', 0, 6.3, 7.7, 5.4),
(11173, 'Lê Trạc Hiệp', 42, '1999/01/13', 1, 9.6, 8.3, 7.3),
(11174, 'Đặng Đức Hiếu', 30, '1999/02/16', 0, 5.1, 5.8, 8),
(11175, 'Trịnh Thế Hiếu', 50, '1999/11/24', 1, 8.2, 5.5, 5.1),
(11176, 'Hoàng Văn Hiếu', 24, '1999/03/02', 0, 8.3, 9, 5.5),
(11177, 'Phạm Minh Hiếu', 5, '1999/02/14', 1, 7.7, 5.4, 6.3),
(11178, 'Ngô Anh Hiệu', 30, '1999/11/04', 0, 8, 7.4, 6.3),
(11179, 'Nguyễn Văn Hoà', 21, '1999/11/12', 1, 5.8, 6.3, 6.2),
(11180, 'Đặng Văn Hòa', 64, '1999/07/25', 0, 8, 8.5, 6.7),
(11181, 'Đỗ Văn Hòa', 17, '1999/05/29', 1, 9.7, 5.1, 6.1),
(11182, 'Đinh Duy Hoan', 17, '1997/02/04', 0, 10, 6.4, 9.6),
(11183, 'Nguyễn Minh Hoàng', 8, '1999/06/20', 1, 7, 9.2, 6.5),
(11184, 'Trần Trọng Hoàng', 46, '1999/02/02', 0, 9, 7.5, 7.9),
(11185, 'Trần Viết Hoàng', 51, '1999/09/04', 1, 8.3, 5.5, 5.6),
(11186, 'Lê Thị Hoàng', 60, '1999/07/24', 0, 8.7, 5.1, 7.3),
(11187, 'Đinh Ngọc Hoàng', 5, '1999/06/05', 1, 8.1, 9.9, 6.8),
(11188, 'Nguyễn Ngọc Hoàng', 9, '1999/02/14', 0, 6.6, 5.5, 8.8),
(11189, 'Phạm Viết Hoàng', 23, '1999/11/08', 1, 9.8, 5.9, 8.2),
(11190, 'Cao Ngọc Huấn', 38, '1999/04/01', 0, 7.6, 9.9, 5.7),
(11191, 'Trần Thế Hùng', 18, '1999/07/01', 1, 6.7, 5.6, 7),
(11192, 'Đỗ Hiếu Hùng', 1, '1999/08/20', 0, 8.8, 6, 7.7),
(11193, 'Nguyễn Trọng Hưng', 53, '1999/05/23', 1, 7.8, 6.6, 7.3),
(11194, 'Nguyễn Đức Hưng', 55, '1999/12/17', 0, 5.2, 9.8, 9.6),
(11195, 'Trần Công Hương', 62, '1999/02/13', 1, 9.6, 8, 8),
(11196, 'Trần Văn Hương', 6, '1999/02/11', 0, 5.4, 6.2, 9.5),
(11197, 'Phạm Đức Hương', 15, '1999/04/05', 1, 5.5, 9.9, 6.6),
(11198, 'Hoàng Tuấn Huy', 2, '1999/12/28', 0, 6, 9.3, 8.7),
(11199, 'Hoàng Đình Huy', 29, '1998/06/03', 1, 9.4, 9.8, 7.4),
(11200, 'Lại Thị Huy', 47, '1999/05/07', 0, 6.3, 6.9, 8.2),
(11201, 'Nguyễn Văn Huy', 49, '1999/06/26', 1, 5.9, 8, 6.5),
(11202, 'Nguyễn Thị Huy', 33, '1999/05/28', 0, 9, 8.7, 10),
(11203, 'Lê Thị Huy', 59, '1998/03/23', 1, 9.8, 5.9, 9.9),
(11204, 'Vũ Thành Huyền', 56, '1999/01/11', 0, 7.5, 9.1, 6.3),
(11205, 'Nguyễn Khoa Huỳnh', 26, '1999/01/22', 1, 7, 6.4, 6.3),
(11206, 'Nguyễn Duy Khải', 10, '1999/01/12', 0, 9.1, 9.7, 7.5),
(11207, 'Nguyễn Bá Khánh', 2, '1999/12/24', 1, 9.4, 7.9, 9.3),
(11208, 'Nguyễn Xuân Khởi', 11, '1999/10/04', 0, 6.4, 8, 6.6),
(11209, 'Đỗ Thị Kiên', 48, '1997/01/09', 1, 5.2, 5.7, 9),
(11210, 'Phạm Đình Linh', 19, '1999/11/04', 0, 8.6, 6.5, 10),
(11211, 'Nguyễn Thanh Linh', 22, '1999/09/02', 1, 7.1, 9.6, 7.4),
(11212, 'Đinh Thế Linh', 33, '1999/07/14', 0, 8.6, 6.8, 5.3),
(11213, 'Dương Duy Lộc', 52, '1998/03/09', 1, 7.1, 7.6, 5.6),
(11214, 'Nguyễn Văn Lợi', 58, '1999/09/27', 0, 5.6, 8.1, 7.5),
(11215, 'Nguyễn Khương Long', 24, '1999/03/23', 1, 7, 6.6, 5.7),
(11216, 'Nguyễn Thanh Long', 57, '1995/09/02', 0, 6, 8.1, 8.6),
(11217, 'Bùi Minh Lương', 31, '1999/04/18', 1, 6, 6.3, 6.9),
(11218, 'Lê Thị Lượng', 37, '1999/06/22', 0, 6.8, 6.8, 9.2),
(11219, 'Hà Việt Luyến', 60, '1999/09/24', 1, 5.6, 9.9, 8.9),
(11220, 'Nguyễn Văn Lý', 63, '1999/08/14', 0, 6.4, 8.2, 5.1),
(11221, 'Nguyễn Thị Mạnh', 28, '1999/07/07', 1, 8.2, 7.2, 9.2),
(11222, 'Đồng Văn Mạnh', 53, '1999/07/16', 0, 8.7, 8.8, 8.5),
(11223, 'Đỗ Tùng Mây', 25, '1999/05/22', 1, 5.5, 8.1, 6.1),
(11224, 'Trần Danh Minh', 31, '1999/01/30', 0, 6.3, 6.3, 6.7),
(11225, 'Đỗ Duy Minh', 39, '1999/10/03', 1, 8.3, 8, 9),
(11226, 'Ngô Quang Minh', 58, '1999/10/25', 0, 6.1, 5.5, 8.7),
(11227, 'Nguyễn Thị Minh', 45, '1999/06/25', 1, 6.5, 6.5, 7.3),
(11228, 'Lê Sỹ Nam', 36, '1999/11/14', 0, 7.9, 9.1, 9.3),
(11229, 'Đào Mạnh Nam', 38, '1998/03/14', 1, 8.2, 7.7, 5.5),
(11230, 'Nguyễn Văn Nam', 7, '1999/12/01', 0, 6.9, 7.5, 9.8),
(11233, 'Bùi Đăng Nam', 58, '1999/01/03', 1, 7.5, 6.6, 8.9),
(11234, 'Nguyễn Khắc Ngân', 32, '1999/05/19', 0, 7, 5.2, 7.2),
(11235, 'Lê Đình Nghĩa', 29, '1999/08/24', 1, 6, 8.6, 6.7),
(11236, 'Đỗ Văn Nghĩa', 2, '1999/09/09', 0, 5.2, 7.8, 8.5),
(11237, 'Nguyễn Hoàng Nghĩa', 16, '1999/04/05', 1, 8.4, 6.7, 5.3),
(11238, 'Nguyễn Đức Ngọc', 50, '1999/06/04', 0, 5.9, 8.7, 5.6),
(11239, 'Trần Văn Ngọc', 57, '1999/04/28', 1, 5.1, 6.3, 5.3),
(11240, 'Nguyễn Ngọc Nguyệt', 63, '1998/10/28', 0, 6.9, 8.2, 6.9),
(11241, 'Lê Thị Nhài', 54, '1999/07/15', 1, 6.5, 5.4, 8),
(11242, 'Nguyễn Văn Nhi', 46, '1998/12/18', 0, 8, 5.2, 6.3),
(11243, 'Phạm Quốc Như', 61, '1999/01/03', 1, 9.4, 6.7, 8),
(11244, 'Đặng Đình Ninh', 28, '1999/01/15', 0, 9.7, 8.5, 6.9),
(11245, 'Lê Trọng Oanh', 35, '1999/11/20', 1, 9.4, 6, 6.8),
(11246, 'Nguyễn Thị Phấn', 48, '1999/06/06', 0, 8.3, 9, 5.1),
(11247, 'Nguyễn Thị Phi', 12, '1999/03/10', 1, 5.1, 6, 5.4),
(11248, 'Phạm Minh Phi', 52, '1999/05/13', 0, 8, 6.9, 6.5),
(11249, 'Trương Quốc Phong', 45, '1999/07/23', 1, 5.3, 8.2, 7.2),
(11250, 'Nguyễn Văn Quân', 27, '1998/08/11', 0, 6.9, 9.6, 7.6),
(11251, 'Nguyễn Văn Quang', 38, '1999/04/04', 1, 6, 9.7, 8.8),
(11252, 'Bùi Minh Quang', 8, '1999/09/16', 0, 8.5, 9.5, 6),
(11253, 'Vũ Tuấn Quang', 19, '1999/02/16', 1, 6.3, 6.6, 9.1),
(11254, 'Nguyễn Thái Quảng', 53, '1998/08/09', 0, 8.6, 8.5, 6.8),
(11255, 'Lê Thị Quý', 32, '1999/09/04', 1, 8.1, 7, 7.6),
(11256, 'Nguyễn Đức Quyền', 27, '1998/02/17', 0, 6.6, 7.3, 6.9),
(11257, 'Nguyễn Viết Quỳnh', 32, '1999/10/31', 1, 5.7, 8.3, 8.2),
(11258, 'Nguyễn Văn Sơn', 15, '1999/03/02', 0, 5.6, 7, 5.4),
(11259, 'Nguyễn Văn Sơn', 12, '1999/11/21', 1, 7.4, 8.2, 7.1),
(11260, 'Lê Đình Sơn', 44, '1998/09/15', 0, 5.7, 9.7, 8.9),
(11261, 'Lê Anh Sơn', 37, '1999/06/03', 1, 6.4, 7.1, 5.2),
(11262, 'Trương Văn Sỹ', 19, '1999/10/10', 0, 6, 5.9, 8.9),
(11263, 'Mai Tiến Tài', 19, '1999/01/14', 1, 5.3, 9.5, 8.9),
(11264, 'Lê Nguyễn Tài', 1, '1999/06/28', 0, 7.7, 8.5, 7.1),
(11265, 'Lê Ánh Tài', 55, '1999/04/22', 1, 7.5, 6.1, 8.6),
(11266, 'Đỗ Anh Thắng', 37, '1999/08/26', 0, 6.5, 6, 9.4),
(11267, 'Nguyễn Mạnh Thắng', 40, '1999/04/16', 1, 5.5, 9.8, 5.3),
(11268, 'Phan Hoàng Thắng', 22, '1999/02/15', 0, 7.2, 6.6, 6),
(11269, 'Nguyễn Thị Thanh', 10, '1999/08/26', 1, 5.2, 5.7, 8),
(11270, 'Trương Quang Thành', 23, '1999/06/15', 0, 9.2, 7.5, 6.7),
(11271, 'Vũ Nam Thành', 26, '1998/01/10', 1, 6.7, 8.6, 5.2),
(11272, 'Nguyễn Hoàng Thành', 36, '1999/10/09', 0, 6.3, 9.9, 7.3),
(11273, 'Đỗ Xuân Thảo', 18, '1998/09/27', 1, 6.9, 6.4, 8.9),
(11274, 'Nguyễn Quang Thảo', 14, '1999/09/28', 0, 5.7, 7.4, 6.2),
(11275, 'Nguyễn Tiến Thảo', 62, '1999/04/20', 1, 6.8, 8.3, 9.7),
(11276, 'Đinh Thế Thiện', 29, '1998/09/09', 0, 5.3, 8.5, 7),
(11277, 'Đỗ Xuân Thư', 49, '1998/12/04', 1, 5.8, 7.6, 9.8),
(11278, 'Nguyễn Tiến Thuật', 14, '1999/01/16', 0, 5.8, 9.4, 8.9),
(11279, 'Nguyễn Trường Thúy', 13, '1999/03/23', 1, 9.2, 5.4, 6.3),
(11280, 'Nguyễn Văn Thúy', 39, '1999/04/24', 0, 6.7, 6.9, 5.9),
(11281, 'Nguyễn Văn Thủy', 34, '1999/01/07', 1, 6.9, 8.9, 6.4),
(11282, 'Nguyễn Duy Thủy', 64, '1996/09/28', 0, 9.4, 5.9, 8.2),
(11283, 'Phan Ngọc Tiến', 59, '1999/08/17', 1, 5.1, 8.2, 8),
(11284, 'Hà Mạnh Tiến', 13, '1999/09/09', 0, 9.7, 5.2, 9.3),
(11285, 'Nguyễn Ngọc Tiến', 4, '1999/08/25', 1, 8.6, 5.3, 5.4),
(11286, 'Dương Khắc Tình', 11, '1999/07/07', 0, 9.5, 7.9, 7.5),
(11287, 'Nguyễn Xuân Tĩnh', 25, '1998/06/12', 1, 9.8, 6.6, 5.5),
(11288, 'Nguyễn Mạnh Toàn', 41, '1995/04/14', 0, 6, 8.3, 6.5),
(11289, 'Trần Huy Toàn', 64, '1999/04/04', 1, 9.2, 6.6, 6.4),
(11290, 'Lê Việt Tràn', 61, '1999/05/12', 0, 5.2, 9.7, 8.4),
(11291, 'Vũ Đình Trang', 3, '1999/01/30', 1, 8.2, 5.1, 9.1),
(11292, 'Nguyễn Văn Trí', 28, '1999/05/10', 0, 7.6, 7.3, 8.2),
(11293, 'Nguyễn Năng Triệu', 56, '1999/02/23', 1, 5.1, 6.2, 8.4),
(11294, 'Thiều Văn Trung', 4, '1998/08/24', 0, 7.3, 7, 9.3),
(11295, 'Nguyễn Khánh Trung', 49, '1999/08/01', 1, 5.5, 9.2, 9.5),
(11296, 'Trần Minh Trường', 35, '1999/07/19', 0, 6.8, 8.4, 6.5),
(11297, 'Bùi Văn Trường', 15, '1999/04/02', 1, 6.1, 5.1, 8.1),
(11298, 'Đỗ Hoàng Trường', 59, '1999/05/16', 0, 6.8, 6.9, 8.6),
(11299, 'Trịnh Duy Tú', 12, '1999/10/22', 1, 10, 8.5, 5.2),
(11300, 'Nguyễn Minh Tú', 42, '1999/04/28', 0, 6.2, 7.1, 5.7),
(11301, 'Phạm Đức Tú', 43, '1999/01/19', 1, 7, 5.9, 7.4),
(11302, 'Nguyễn Văn Tuân', 35, '1999/08/12', 0, 8.6, 9.6, 7.6),
(11303, 'Lê Văn Tuấn', 5, '1999/03/01', 1, 7.9, 5.2, 7.9),
(11304, 'Nguyễn Vũ Tuấn', 9, '1999/02/04', 0, 9.9, 7.8, 9.2),
(11305, 'Hoàng Văn Tuấn', 36, '1999/04/11', 1, 8.7, 6.3, 6.6),
(11306, 'Đỗ Tất Tuấn', 30, '1999/09/08', 0, 7.3, 7.4, 7.7),
(11307, 'Nguyễn Đức Việt', 52, '1999/01/08', 1, 9.3, 7.2, 6.6),
(11308, 'Lê Quang Vinh', 5, '1999/12/16', 0, 9.9, 5.9, 6.4),
(11309, 'Trần Văn Vượng', 33, '1999/07/28', 1, 5.4, 9.1, 7.9),
(696969, 'Liên Lung Link', 1, '1997-01-12', 1, 9, 9, 9);

-- --------------------------------------------------------

--
-- Table structure for table `tinhthanh`
--

CREATE TABLE `tinhthanh` (
  `MaTinh` int(11) NOT NULL,
  `TenTinh` varchar(50) DEFAULT NULL,
  `TenTinhKhongDau` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `tinhthanh`
--

INSERT INTO `tinhthanh` (`MaTinh`, `TenTinh`, `TenTinhKhongDau`) VALUES
(1, 'Hà Nội', 'Ha Noi'),
(2, 'Hồ Chí Minh', 'Ho Chi Minh'),
(3, 'Hải Phòng', 'Hai Phong'),
(4, 'Đà Nẵng', 'Da Nang'),
(5, 'Hà Giang', 'Ha Giang'),
(6, 'Cao Bằng', 'Cao Bang'),
(7, 'Lai Châu', 'Lai Chau'),
(8, 'Lào Cai', 'Lao Cai'),
(9, 'Tuyên Quang', 'Tuyen Quang'),
(10, 'Lạng Sơn', 'Lang Son'),
(11, 'Bắc Kạn', 'Bac Kan'),
(12, 'Thái Nguyên', 'Thai Nguyen'),
(13, 'Yên Bái', 'Yen Bai'),
(14, 'Sơn La', 'Son La'),
(15, 'Phú Thọ', 'Phu Tho'),
(16, 'Vĩnh Phúc', 'Vinh Phuc'),
(17, 'Quảng Ninh', 'Quang Ninh'),
(18, 'Bắc Giang', 'Bac Giang'),
(19, 'Bắc Ninh', 'Bac Ninh'),
(21, 'Hải Dương', 'Hai Duong'),
(22, 'Hưng Yên', 'Hung Yen'),
(23, 'Hòa Bình', 'Hoa Binh'),
(24, 'Hà Nam', 'Ha Nam'),
(25, 'Nam Định', 'Nam Dinh'),
(26, 'Thái Bình', 'Thai Binh'),
(27, 'Ninh Bình', 'Ninh Binh'),
(28, 'Thanh Hóa', 'Thanh Hoa'),
(29, 'Nghệ An', 'Nghe An'),
(30, 'Hà Tĩnh', 'Ha Tinh'),
(31, 'Quảng Bình', 'Quang Binh'),
(32, 'Quảng Trị', 'Quang Tri'),
(33, 'Thừa Thiên Huế', 'Thua Thien Hue'),
(34, 'Quảng Nam', 'Quang Nam'),
(35, 'Quảng Ngãi', 'Quang Ngai'),
(36, 'Kon Tum', 'Kon Tum'),
(37, 'Bình Định', 'Binh Dinh'),
(38, 'Gia Lai', 'Gia Lai'),
(39, 'Phú Yên', 'Phu Yen'),
(40, 'Đăk Lăk', 'Dak Lak'),
(41, 'Khánh Hòa', 'Khanh Hoa'),
(42, 'Lâm Đồng', 'Lam Dong'),
(43, 'Bình Phước', 'Binh Phuoc'),
(44, 'Bình Dương', 'Binh Duong'),
(45, 'Ninh Thuận', 'Ninh Thuan'),
(46, 'Tây Ninh', 'Tay Ninh'),
(47, 'Bình Thuận', 'Binh Thuan'),
(48, 'Đồng Nai', 'Dong Nai'),
(49, 'Long An', 'Long An'),
(50, 'Đồng Tháp', 'Dong Thap'),
(51, 'An Giang', 'An Giang'),
(52, 'Bà Rịa - Vũng Tàu', 'Ba Ria - Vung Tau'),
(53, 'Tiền Giang', 'Tien Giang'),
(54, 'Kiên Giang', 'Kien Giang'),
(55, 'Cần Thơ', 'Can Tho'),
(56, 'Bến Tre', 'Ben Tre'),
(57, 'Vĩnh Long', 'Vinh Long'),
(58, 'Trà Vinh', 'Tra Vinh'),
(59, 'Sóc Trăng', 'Soc Trang'),
(60, 'Bạc Liêu', 'Bac Lieu'),
(61, 'Cà Mau', 'Ca Mau'),
(62, 'Điện Biên', 'Dien Bien'),
(63, 'Đăk Nông', 'Dak Nong'),
(64, 'Hậu Giang', 'Hau Giang');

-- --------------------------------------------------------

--
-- Table structure for table `version`
--

CREATE TABLE `version` (
  `id` int(11) NOT NULL,
  `ver` varchar(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `version`
--

INSERT INTO `version` (`id`, `ver`) VALUES
(1, '1.0.0');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `thisinh`
--
ALTER TABLE `thisinh`
  ADD PRIMARY KEY (`MaThiSinh`),
  ADD KEY `fk_thisinh_maquequan` (`MaQueQuan`);

--
-- Indexes for table `tinhthanh`
--
ALTER TABLE `tinhthanh`
  ADD PRIMARY KEY (`MaTinh`);

--
-- Indexes for table `version`
--
ALTER TABLE `version`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `version`
--
ALTER TABLE `version`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- Constraints for dumped tables
--

--
-- Constraints for table `thisinh`
--
ALTER TABLE `thisinh`
  ADD CONSTRAINT `fk_thisinh_maquequan` FOREIGN KEY (`MaQueQuan`) REFERENCES `tinhthanh` (`MaTinh`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
